books/deep-work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-09 Thu 21:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Deep Work</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Deep Work</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org98412b4">Notes</a>
<ul>
<li><a href="#orgd0e0084">Main concepts</a></li>
<li><a href="#org4027c55">Part 1: The idea</a>
<ul>
<li><a href="#org5ebb05d">Chapter 1 - Deep work is  valuable</a></li>
<li><a href="#org3d2c301">Chapter 2 - Deep work is rare</a></li>
<li><a href="#orga1b6dbd">Chapter 3 - Deep work is meaningful</a></li>
</ul>
</li>
<li><a href="#org9b55374">Part 2: The rules</a>
<ul>
<li><a href="#orgaf383fa">Rule #1: Work deeply</a></li>
<li><a href="#orga6b853f">Rule #2: Embrace Boredom</a></li>
<li><a href="#orgf0d8c8d">Rule #3: Quit Social Media</a></li>
<li><a href="#orgde344fa">Rule #4: Drain the Shallows</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org98412b4" class="outline-2">
<h2 id="org98412b4">Notes</h2>
<div class="outline-text-2" id="text-org98412b4">
<p>
Rating: ⭐⭐⭐⭐⭐
</p>

<p>
My notes from Deep Work: <a href="https://www.amazon.com/Deep-Work-Focused-Success-Distracted/dp/1455586692">https://www.amazon.com/Deep-Work-Focused-Success-Distracted/dp/1455586692</a>
</p>

<p class="verse">
The Deep Work Hypothesis: The ability to perform deep work is becoming<br />
increasingly rare at exactly the same time it is becoming increasingly<br />
valuable in our economy. As a consequence, the few who cultivate this<br />
skill, and then make it the core of their working life, will thrive.<br />
<br />
&#xa0;&#xa0;&#xa0;&#x2014;Newport, Cal. Deep Work (p. 14). Grand Central Publishing. Kindle Edition.<br />
</p>
</div>
<div id="outline-container-orgd0e0084" class="outline-3">
<h3 id="orgd0e0084">Main concepts</h3>
<div class="outline-text-3" id="text-orgd0e0084">
<ul class="org-ul">
<li>Deep work:</li>
</ul>

<p class="verse">
Deep Work: Professional activities performed in a state of<br />
distraction-free concentration that push your cognitive capabilities<br />
to their limit. These efforts create new value, improve your skill,<br />
and are hard to replicate.<br />
<br />
&#xa0;&#xa0;&#xa0;&#x2014;Newport, Cal. Deep Work (p. 3). Grand Central Publishing. Kindle Edition.<br />
</p>

<ul class="org-ul">
<li>Shallow work:</li>
</ul>
<p class="verse">
Shallow Work: Noncognitively demanding, logistical-style tasks, often<br />
performed while distracted. These efforts tend to not create much new<br />
value in the world and are easy to replicate.<br />
<br />
&#xa0;&#xa0;&#xa0;&#x2014;Newport, Cal. Deep Work (p. 6). Grand Central Publishing. Kindle Edition.<br />
</p>
</div>
</div>

<div id="outline-container-org4027c55" class="outline-3">
<h3 id="org4027c55">Part 1: The idea</h3>
<div class="outline-text-3" id="text-org4027c55">
</div>
<div id="outline-container-org5ebb05d" class="outline-4">
<h4 id="org5ebb05d">Chapter 1 - Deep work is  valuable</h4>
<div class="outline-text-4" id="text-org5ebb05d">
<p>
Deep work brings benefits, it help us to concentrate on hard problems
and achieve important things.
</p>

<p>
In today's economy, three groups will have a particular advantage:
</p>
<ol class="org-ol">
<li>Those who can work well and creatively with intelligent machines</li>
<li>Those who are the best at what they do.</li>

<li>Those with access to capital.</li>
</ol>

<p>
To achieve 3 requires capital, but 1 and 2 can be done through deep work.
</p>

<p class="verse">
Two Core Abilities for Thriving in the New Economy<br />
<br />
1. The ability to quickly master hard things.<br />
2. The ability to produce at an elite level, in terms of both quality and speed.<br />
<br />
&#xa0;&#xa0;&#xa0;&#x2014;Newport, Cal. Deep Work (p. 29). Grand Central Publishing. Kindle Edition.<br />
</p>
</div>
</div>


<div id="outline-container-org3d2c301" class="outline-4">
<h4 id="org3d2c301">Chapter 2 - Deep work is rare</h4>
<div class="outline-text-4" id="text-org3d2c301">
<p>
Current business trends are making it more difficult to develop deep
work even though it should be a priority for companies. There are
multiple reasons for this, among them:
</p>

<ul class="org-ul">
<li>A culture of of constant connectivity: It's hard to measure how
an instant message or interrupting a coworker. In this kind of
settings we will tend towards behaviors that are the easiest at
the moment. Principle of least resistant.</li>
<li>People tend to do many different things (mostly shallow work)
appearing productive, but this is just Busyness as a proxy for
productivity. There is no deep work on things like answering
emails or being "present" in slack.</li>
<li>Internet-centrism: Our current culture rewards being visible and
appear on internet. However this requires interruptions and make
it hard to develop deep work.</li>
</ul>

<p class="verse">
Deep work is at a severe disadvantage in a techno-poly because it<br />
builds on values like quality, craftsmanship, and mastery that are<br />
decidedly old-fashioned and non-technological.<br />
</p>


<p>
The fact that this trends continues, give you a personal
advantage. Since deep will become scarce and therefore valuable.
</p>
</div>
</div>

<div id="outline-container-orga1b6dbd" class="outline-4">
<h4 id="orga1b6dbd">Chapter 3 - Deep work is meaningful</h4>
<div class="outline-text-4" id="text-orga1b6dbd">
<ul class="org-ul">
<li>Deep work can generate as much satisfaction in an information economy as it does in a craft economy.</li>
<li>When we interact all the time with shallow concerns there issues remain at the front of our attention</li>
<li>Deep work can help us generate flow state.
<ul class="org-ul">
<li>The content of what we focus on matters.</li>
<li>We can experience a more important and positive life when we can work on important things.</li>
</ul></li>
<li><p>
From Csikszentmihalyi’s:
</p>
<p class="verse">
Ironically, jobs are actually easier to enjoy than free time,<br />
because like flow activities they have built-in goals, feedback<br />
rules, and challenges, all of which encourage one to become involved<br />
in one’s work, to concentrate and lose oneself in it. Free time, on<br />
the other hand, is unstructured, and requires much greater effort to<br />
be shaped into something that can be enjoyed.<br />
</p></li>
<li>Gallagher:
<ul class="org-ul">
<li>The idle mind is the devil's workshop: when we lose focus, we get
fix on what is wrong with our life instead of what's right.</li>
<li>Shallow things are draining and upsetting even when they appeared to be fun.</li>
<li>Doing deep work maximizes the meaning and satisfaction associated with our working life.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9b55374" class="outline-3">
<h3 id="org9b55374">Part 2: The rules</h3>
<div class="outline-text-3" id="text-org9b55374">
</div>
<div id="outline-container-orgaf383fa" class="outline-4">
<h4 id="orgaf383fa">Rule #1: Work deeply</h4>
<div class="outline-text-4" id="text-orgaf383fa">
<p>
In an ideal work we should be able to have environments that foster
deep work, however, that is far from true today, as mentioned in <a href="#org3d2c301">chapter 2</a>.
</p>

<p>
Hence we need to work on strategies to achieve deep work. There are different kinds:
</p>

<ul class="org-ul">
<li>Monastic: This is way of achieving deep work, which consists in disconnecting from the world.
<ul class="org-ul">
<li>Don Knuth and Neal Stephenson used to work on this modality.</li>
</ul></li>
<li>Bi-modal: It is a combination between going monastic from a period and then coming back.
<ul class="org-ul">
<li>Carl Jung used to spend time between a small house in the country side and Vienna.</li>
</ul></li>
<li>Rhythmic  philosophy: Maintain a visual indicator of your work and set aside specific time for this.
<ul class="org-ul">
<li>Seinfeld chain method: he use to cross a mark in a calendar every
day he'll come up with a new joke. Practicing every day.</li>
</ul></li>
<li>The journalistic philosophy: Name after the journalist Walter
Isaacson, who used to crank deep work sessions every time he would
see fit.</li>
</ul>

<p>
Creating rituals around our deep work habits will help us make the most of out it.
</p>

<p class="verse">
To make the most out of your deep work sessions, build rituals of the same level of strictness and<br />
idiosyncrasy as the important thinkers mentioned previously.<br />
<br />
&#xa0;&#xa0;&#x2014; Newport, Cal. Deep Work (p. 119). Grand Central Publishing. Kindle Edition.<br />
</p>

<ul class="org-ul">
<li>Have rituals:
<ul class="org-ul">
<li>Where you'll work and for how long.</li>
<li>How you'll work once you start to work. Create metrics and rules, like:
<ul class="org-ul">
<li>No internet.</li>
<li>X words per 20 mins.</li>
</ul></li>
<li>How you'll support your work:
<ul class="org-ul">
<li>Drink coffee</li>
<li>Have a healthy snack</li>
<li>Go exercise after</li>
</ul></li>
</ul></li>

<li>Use the the grand gesture: make a radical change in your work
environment with a significant investment of effort or money.</li>

<li>Don't work alone.</li>
</ul>
<p class="verse">
For the sake of discussion, let’s call this principle—that when you<br />
allow people to bump into each other smart collaborations and new<br />
ideas emerge—the theory of serendipitous creativity.<br />
<br />
&#xa0;&#xa0;&#x2014; Newport, Cal. Deep Work (p. 127). Grand Central Publishing. Kindle Edition.<br />
</p>

<ul class="org-ul">
<li>Execute like a business - Based on 4DX:
<ul class="org-ul">
<li>Discipline #1: Focus on the wildly important, aim at a small number of "wildly important goals"</li>
<li>Discipline #2: Act on the lead measure:
<ul class="org-ul">
<li>Lag measure: describe the thing you are trying to improve</li>
<li>Lead measure: Measure the new behavior that will drive success on lag measure.</li>
</ul></li>
<li>Discipline #3: Keep a completion score board</li>
<li>Discipline #4: Create a cadence of accountability:
<ul class="org-ul">
<li>Discuss scoreboard.</li>
<li>Commit to specific actions.</li>
<li>Describe what happens with the commitments made in the last meeting.</li>
</ul></li>
</ul></li>

<li>Insert downtime:
<ul class="org-ul">
<li>Downtime aids insights.</li>
<li>Downtime helps recharge the energy needed to work deeply. ATR: <a href="https://en.wikipedia.org/wiki/Attention_restoration_theory">https://en.wikipedia.org/wiki/Attention_restoration_theory</a></li>
<li>The work that evening downtime replaces is usually no that important.
Our capacity for deep work is limited.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga6b853f" class="outline-4">
<h4 id="orga6b853f">Rule #2: Embrace Boredom</h4>
<div class="outline-text-4" id="text-orga6b853f">
<ul class="org-ul">
<li>We need to rewire our brains to resist distracting stimulus.</li>
</ul>


<p class="verse">
Once your brain has become accustomed to on-demand distraction, it’s<br />
hard to shake the addiction even when you want to concentrate.<br />
<br />
&#xa0;&#xa0;&#xa0;&#x2014;Newport, Cal. Deep Work (pp. 158-159). Grand Central Publishing. Kindle Edition.<br />
</p>

<ul class="org-ul">
<li>Don't take breaks from distractions. Instead take breaks from focus.
<ul class="org-ul">
<li>Create internet blocks and keep stay internet-free in focus blocks.</li>
</ul></li>

<li>Schedule internet use at home and at work, this could help improve our concentration training.</li>

<li>Meditate productively
<ul class="org-ul">
<li>Use moments like exercising or doing chores to thing about the
hard problems you are trying to solve.</li>

<li>Learn memorization techniques and practice.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf0d8c8d" class="outline-4">
<h4 id="orgf0d8c8d">Rule #3: Quit Social Media</h4>
<div class="outline-text-4" id="text-orgf0d8c8d">
<ul class="org-ul">
<li>Network tools fragment our time and reduce our ability to concentrate.</li>

<li>Avoid the any-benefit approach to tools selection: You are justified
in using a network if you can identify any possible benefit to its
use, or anything you might possibly miss out if you don't use it.
<ul class="org-ul">
<li>There services are engineered to be addictive, taking time from
activities that support our professional career.</li>
</ul></li>

<li>Follow the craftsman approach to tool selection: Only adop the tools
that have a positive impact in your life.</li>
</ul>


<ul class="org-ul">
<li>Don't use the internet to entertain yourself.</li>
</ul>

<p class="verse">
Fortunately, Arnold Bennett identified the solution to this problem a<br />
hundred years earlier: Put more thought into your leisure time. In<br />
other words, this strategy suggests that when it comes to your<br />
relaxation, don’t default to whatever catches your attention at the<br />
moment, but instead dedicate some advance thinking to the question of<br />
how you want to spend your “day within a day.” Addictive websites of<br />
the type mentioned previously thrive in a vacuum: If you haven’t given<br />
yourself something to do in a given moment, they’ll always beckon as<br />
an appealing option. If you instead fill this free time with something<br />
of more quality, their grip on your attention will loosen.<br />
<br />
- Newport, Cal. Deep Work (pp. 212-213). Grand Central Publishing. Kindle Edition.<br />
</p>

<ul class="org-ul">
<li>Attention is a zero-sum game, what you give to low impact activities
is energy you could be given to important tasks.</li>

<li>Social networks give people a sense of self-importance, making them
believe others want to hear what they have to say.</li>

<li>Put more thought into your leisure time: Ask yourself how do you
want to spend you day.</li>
</ul>
</div>
</div>

<div id="outline-container-orgde344fa" class="outline-4">
<h4 id="orgde344fa">Rule #4: Drain the Shallows</h4>
<div class="outline-text-4" id="text-orgde344fa">
<ul class="org-ul">
<li>Shallow work isn't necessarily bad, there is a point where you can't
keep doing deep work. That's a good time to do shallow work. But we
should try to keep it confined.</li>

<li>Strategies to confine shallow work:
<ul class="org-ul">
<li>Keep a schedule.</li>
<li>Create task blocks.</li>
<li>Decide in advance what you're going to be doing with every minute of your workday.</li>
<li><p>
Quantify the deep of every activity.
</p>
<div class="VERBATIM">
<p>
How long would it take (in months) to train a smart recent college
graduate with no specialized training in my field to complete this
task?
</p>

<p>
&#x2014;Newport, Cal. Deep Work (p. 229). Grand Central Publishing. Kindle Edition.
</p>

</div></li>
<li>Bias your tasks towards deep tasks.</li>
<li>Ask you boss for a shallow work budget.
<ul class="org-ul">
<li>What percentage of your time shall we spent on shallow work.</li>
</ul></li>
<li>Have a fix schedule, like finishing work by 5 pm. It helps you
prioritize and know what to commit to.</li>
<li>Become hard to reach
<ul class="org-ul">
<li>Use sender filters.</li>
<li>Do more work when you send or reply to emails.
<ul class="org-ul">
<li><p>
Ask yourself:
</p>
<p class="verse">
What is the project represented by this message, and what is the most<br />
efficient (in terms of messages generated) process for bringing this<br />
project to a successful conclusion?<br />
<br />
&#xa0;&#xa0;&#xa0;&#x2014;Newport, Cal. Deep Work (p. 249). Grand Central Publishing. Kindle<br />
Edition.<br />
</p></li>
</ul></li>
</ul></li>
<li>Don't reply to emails. It's the sender responsibility to convince
you that you must respond, if you don't, then they didn't do a
good job at persuading you.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
